print('работа со словарем')
my_dict={'Marina': 1978, 'Vadim': 2005, 'Polina': 2007} # создал словарь
print(my_dict) # вывел на экран
print('Существующие значение:' ,my_dict['Marina']) #Вывел одно значение по существующему ключу
print('Отсутствующее значение:',my_dict.get('Pasha')) # одно по отсутствующему из словаря my_dict без ошибки
my_dict.update({'Sergey': 1976, 'Nikolay': 1944}) # Добавил ещё две произвольные пары того же формата
print('Удаленное значение:', my_dict['Nikolay']) # значение из этой удаленной пары.
del my_dict['Nikolay'] # Удалил одну из пар в словаре по существующему ключу из словаря
print('Модифицированный словарь:', my_dict)#
print('Работа с множествами')
my_set={1, 2, 78.456, 'txt', True, False, 'txt', 3, 4, 4, 78.456}
print(my_set) # только уникальные значения
my_set.add((6, 7, 8)) # добавили кортеж
my_set.add('булочка') # добавили булочку
print(my_set)
my_set.remove('булочка') # съели булочку
print('Измененное множество' , my_set) # add to Git